feat(layers): replace mermaid & static figure with plantuml #5
